
#include "alt.hpp"

int main()
{
    const int ROWS = 9;
    const int COLS = 9;

    /**
     * 1 - доступная вершина, 0 - препятствие 
     */
    int grid[ROWS * COLS] = { 1, 1, 1, 1, 1, 1, 1, 1, 1,
                              1, 1, 1, 1, 1, 0, 0, 0, 0,
                              1, 1, 0, 1, 1, 1, 1, 1, 1,
                              1, 1, 0, 1, 1, 1, 1, 1, 1,
                              1, 1, 0, 1, 1, 1, 1, 1, 1,
                              1, 1, 1, 1, 1, 1, 1, 1, 1,
                              1, 1, 1, 1, 0, 1, 1, 1, 1,
                              1, 1, 1, 1, 0, 1, 1, 1, 1,
                              1, 1, 1, 1, 0, 1, 1, 1, 1 };

    /**
     * 60 - порядковый номер начальной вершины
     * 8 - порядковый номер конечной вершины
     */
    alt(grid, ROWS, COLS, 60, 8);

    return 0;
}